interface MainTab {
  label: string;
  subTabs?: string[];
};

export const mainTabs: MainTab[] = [
  {
    label: "Карбон",
    subTabs: [
      "Дашборд",
      "Печи Карбонизации",
      "Сушилки",
      "МПА",
      "Мельницы",
      "Отчеты по энергоресурсам",
      "Корпус 296",
    ],
  },
  {
    label: "Угольное производство",
    subTabs: [
      "Вр. печи активации к.266",
      "Отделение активации к.10б",
      "Отделение карбонизации к.10б",
      "Смолохозяйство",
      "Корп. 9а",
      "Расход пара",
    ],
  },
  {
    label: "Узлы учета",
    subTabs: [
      "Отчеты по энергоресурсам",
      "Параметры узлов учета",
      "Вода питьевая и речная + стоки",
      "Природный газ",
    ],
  },
  {
    label: "УТВХ",
    subTabs: [
      "Дашборд",
      "Архивные графики",
      "Станция подмешивания",
      "Теплообменник",
      "Отчеты по энергоресурсам",
    ],
  },
  {
    label: "СИЗОД",
    subTabs: [
      "Автоматические линии",
      "Отопительная вода к.301",
      "Отопительная вода к.302",
      "Отчеты по энергоресурсам",
    ],
  },
  {
    label: "Ресурсы",
    subTabs: ["Энергоресурсы"],
  },
  {
    label: "Симулятор",
    subTabs: ["Симуляторы производства Карбон"],
  },
  {
    label: "Библиотека",
  },
];

export const libraryTabs: MainTab[] = [
  {
    label: "САиМ",
    subTabs: [
      "Инструкции",
      "Схемы",
    ],
  },
  {
    label: "СИЗОД",
    subTabs: [
      "Инструкции",
      "Схемы",
    ],
  },
  {
    label: "Угольное производство",
    subTabs: [
      "Инструкции",
      "Схемы",
    ],
  },
  {
    label: "УТВХ",
    subTabs: [
      "Инструкции",
      "Схемы",
    ],
  },
  {
    label: "УЭХ",
    subTabs: [
      "Инструкции",
      "Схемы",
    ],
  },
  {
    label: "Технологический сайт",
  },
];
