interface MainTab {
  label: string;
  path: string;
  subTabs: string[];
};

export const mainTabs: MainTab[] = [
  {
    label: "Карбон",
    path: "/carbon",
    subTabs: [
      "Дашборд",
      "Печи Карбонизации",
      "Сушилки",
      "МПА",
      "Мельницы",
      "Отчеты по энергоресурсам",
      "Корпус 296",
    ],
  },
  {
    label: "Угольное производство",
    path: "/ugol_production",
    subTabs: [
      "Вр. печи активации к.266",
      "Отделение активации к.10б",
      "Отделение карбонизации к.10б",
      "Смолохозяйство",
      "Корп. 9а",
      "Расход пара",
    ],
  },
  {
    label: "Узлы учета",
    path: "/uzli_ucheta",
    subTabs: [
      "Отчеты по энергоресурсам",
      "Параметры узлов учета",
      "Вода питьевая и речная + стоки",
      "Природный газ",
    ],
  },
  {
    label: "УТВХ",
    path: "/utvh",
    subTabs: [
      "Дашборд",
      "Графики расхода/давление пара",
      "Станция подмешивания",
      "Теплообменник",
      "Отчеты по энергоресурсам",
    ],
  },
  {
    label: "СИЗОД",
    path: "/sizod",
    subTabs: [
      "Автоматические линии",
      "Отопительная вода к.301",
      "Отопительная вода к.302",
      "Отчеты по энергоресурсам",
    ],
  },
  {
    label: "Ресурсы",
    path: "/resources",
    subTabs: ["Энергоресурсы"],
  },
  {
    label: "Симулятор",
    path: "/simulator",
    subTabs: ["Симуляторы производства Карбон"],
  },
];
